<template>
    <div class="container">
        <div class="title">
            <img class="title-backbtn" @click="$router.push('/')" src="@/assets/back.svg" alt="">
            <div class="title-text">Пользовательское соглашение</div>
        </div>
        <div class="text">
            <div class="text-paragraph">
                <div class="text-paragraph-title">1. Общие положения</div>
                <div class="text-paragraph-text">
                    <div class="text-paragraph-text-block">1.1. ООО «ЯНДЕКС» (далее — «Яндекс») предлагает пользователю сети Интернет (далее – Пользователь) - использовать свои сервисы на условиях, изложенных в настоящем Пользовательском соглашении (далее — «Соглашение», «ПС»). Соглашение вступает в силу с момента выражения Пользователем согласия с его условиями в порядке, предусмотренном п. 1.4 Соглашения. </div>
                    <div class="text-paragraph-text-block">1.2. Яндекс предлагает Пользователям доступ к широкому спектру сервисов, включая средства навигации, коммуникации, поиска, размещения и хранения разного рода информации и материалов (контента), персонализации контента, совершения покупок и т. д. Все существующие на данный момент сервисы ООО «ЯНДЕКС» и других компаний, условия использования которых ссылаются на данное Соглашение, а также любое развитие их и/или добавление новых является предметом настоящего Соглашения. </div>
                    <div class="text-paragraph-text-block">1.3. Использование сервисов Яндекса регулируется настоящим Соглашением, а также следующими документами, которые являются неотъемлемой частью настоящего соглашения:</div>
                </div>
            </div>
            <div class="text-paragraph">
                <div class="text-paragraph-title">1. Общие положения</div>
                <div class="text-paragraph-text">
                    <div class="text-paragraph-text-block">1.1. ООО «ЯНДЕКС» (далее — «Яндекс») предлагает пользователю сети Интернет (далее – Пользователь) - использовать свои сервисы на условиях, изложенных в настоящем Пользовательском соглашении (далее — «Соглашение», «ПС»). Соглашение вступает в силу с момента выражения Пользователем согласия с его условиями в порядке, предусмотренном п. 1.4 Соглашения. </div>
                    <div class="text-paragraph-text-block">1.2. Яндекс предлагает Пользователям доступ к широкому спектру сервисов, включая средства навигации, коммуникации, поиска, размещения и хранения разного рода информации и материалов (контента), персонализации контента, совершения покупок и т. д. Все существующие на данный момент сервисы ООО «ЯНДЕКС» и других компаний, условия использования которых ссылаются на данное Соглашение, а также любое развитие их и/или добавление новых является предметом настоящего Соглашения. </div>
                    <div class="text-paragraph-text-block">1.3. Использование сервисов Яндекса регулируется настоящим Соглашением, а также следующими документами, которые являются неотъемлемой частью настоящего соглашения:</div>
                </div>
            </div>
            <div class="text-paragraph">
                <div class="text-paragraph-title">1. Общие положения</div>
                <div class="text-paragraph-text">
                    <div class="text-paragraph-text-block">1.1. ООО «ЯНДЕКС» (далее — «Яндекс») предлагает пользователю сети Интернет (далее – Пользователь) - использовать свои сервисы на условиях, изложенных в настоящем Пользовательском соглашении (далее — «Соглашение», «ПС»). Соглашение вступает в силу с момента выражения Пользователем согласия с его условиями в порядке, предусмотренном п. 1.4 Соглашения. </div>
                    <div class="text-paragraph-text-block">1.2. Яндекс предлагает Пользователям доступ к широкому спектру сервисов, включая средства навигации, коммуникации, поиска, размещения и хранения разного рода информации и материалов (контента), персонализации контента, совершения покупок и т. д. Все существующие на данный момент сервисы ООО «ЯНДЕКС» и других компаний, условия использования которых ссылаются на данное Соглашение, а также любое развитие их и/или добавление новых является предметом настоящего Соглашения. </div>
                    <div class="text-paragraph-text-block">1.3. Использование сервисов Яндекса регулируется настоящим Соглашением, а также следующими документами, которые являются неотъемлемой частью настоящего соглашения:</div>
                </div>
            </div>
        </div>
    </div>
</template>

<style lang="scss" scoped>
@import '@/assets/style.scss';
.container {
    display: flex;
    flex-direction: column;
    gap: rem(40);

    & * {
        font-family: 'Gilroy';
        font-style: normal;
        color: #212629;
    }
}
.title {
    position: relative;
    align-items: center;
    &-backbtn {
        position: absolute;
        top: 50%;
        transform: translateY(-50%);
        left: rem(-40);
        height: rem(14);
        padding: rem(6);
        cursor: pointer;
    }
    &-text {
        font-weight: 700;
        font-size: rem(32);
    }
}
.text {
    display: flex;
    flex-direction: column;
    gap: rem(30);

    &-paragraph {
        display: flex;
        flex-direction: column;
        gap: rem(20);

        &-title {
            font-weight: 700;
            font-size: rem(20);
        }
        &-text {
            display: flex;
            flex-direction: column;
            gap: rem(16);

            &-block {
                font-weight: 300;
                font-size: rem(17);
                //color: rgba(33, 38, 41, 0.5);
            }
        }
    }
}
</style>

<script setup>

</script>